{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "num_labels": 11,
  "id2label": {
    "0": "B-EXP",
    "1": "B-LOC",
    "2": "B-ROLE",
    "3": "B-SALARY",
    "4": "B-SKILL",
    "5": "I-EXP",
    "6": "I-LOC",
    "7": "I-ROLE",
    "8": "I-SALARY",
    "9": "I-SKILL",
    "10": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-EXP": 0,
    "B-LOC": 1,
    "B-ROLE": 2,
    "B-SALARY": 3,
    "B-SKILL": 4,
    "I-EXP": 5,
    "I-LOC": 6,
    "I-ROLE": 7,
    "I-SALARY": 8,
    "I-SKILL": 9,
    "O": 10
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 28996
}
