{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-EXP",
    "1": "B-LOC",
    "2": "B-ROLE",
    "3": "B-SALARY",
    "4": "B-SKILL",
    "5": "I-EXP",
    "6": "I-LOC",
    "7": "I-ROLE",
    "8": "I-SALARY",
    "9": "I-SKILL",
    "10": "LOC",
    "11": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-EXP": 0,
    "B-LOC": 1,
    "B-ROLE": 2,
    "B-SALARY": 3,
    "B-SKILL": 4,
    "I-EXP": 5,
    "I-LOC": 6,
    "I-ROLE": 7,
    "I-SALARY": 8,
    "I-SKILL": 9,
    "LOC": 10,
    "O": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 28996
}
